详情结果/原始结果/scylla_runC.txt
[WARN]  Running against a source checkout. In order to get our runtime dependencies we'll have to invoke Maven. Depending on the state of your system, this may take ~30-45 seconds
[DEBUG]  Running 'mvn -pl com.yahoo.ycsb:cassandra-binding -am package -DskipTests dependency:build-classpath -DincludeScope=compile -Dmdep.outputFilterFile=true'
java -cp /home/YCSB/cassandra/conf:/home/YCSB/cassandra/target/cassandra-binding-0.15.0.jar:/root/.m2/repository/org/apache/htrace/htrace-core4/4.1.0-incubating/htrace-core4-4.1.0-incubating.jar:/root/.m2/repository/org/hdrhistogram/HdrHistogram/2.1.4/HdrHistogram-2.1.4.jar:/root/.m2/repository/io/dropwizard/metrics/metrics-core/3.1.2/metrics-core-3.1.2.jar:/root/.m2/repository/com/datastax/cassandra/cassandra-driver-core/3.0.0/cassandra-driver-core-3.0.0.jar:/root/.m2/repository/io/netty/netty-handler/4.0.33.Final/netty-handler-4.0.33.Final.jar:/root/.m2/repository/org/codehaus/jackson/jackson-core-asl/1.9.4/jackson-core-asl-1.9.4.jar:/home/YCSB/core/target/core-0.15.0.jar:/root/.m2/repository/org/slf4j/slf4j-api/1.7.25/slf4j-api-1.7.25.jar:/root/.m2/repository/io/netty/netty-transport/4.0.33.Final/netty-transport-4.0.33.Final.jar:/root/.m2/repository/io/netty/netty-codec/4.0.33.Final/netty-codec-4.0.33.Final.jar:/root/.m2/repository/com/google/guava/guava/16.0.1/guava-16.0.1.jar:/root/.m2/repository/org/codehaus/jackson/jackson-mapper-asl/1.9.4/jackson-mapper-asl-1.9.4.jar:/root/.m2/repository/io/netty/netty-buffer/4.0.33.Final/netty-buffer-4.0.33.Final.jar:/root/.m2/repository/io/netty/netty-common/4.0.33.Final/netty-common-4.0.33.Final.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.CassandraCQLClient -s -P workloads/workloadc -p hosts=192.168.4.134 -p port=9042 -p cassandra.keyspace=ycsb -p cassandra.username=cassandra -p cassandra.password=cassandra -threads 100 -t
Command line: -db com.yahoo.ycsb.db.CassandraCQLClient -s -P workloads/workloadc -p hosts=192.168.4.134 -p port=9042 -p cassandra.keyspace=ycsb -p cassandra.username=cassandra -p cassandra.password=cassandra -threads 100 -t
YCSB Client 0.15.0

Loading workload...
Starting test.
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".
SLF4J: Defaulting to no-operation (NOP) logger implementation
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.
2018-12-28 19:39:11:323 0 sec: 0 operations; est completion in 0 second 
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2018-12-28 19:39:21:294 10 sec: 124273 operations; 12427.3 current ops/sec; est completion in 13 minutes [READ: Count=124273, Max=94655, Min=1977, Avg=7607.68, 90=10375, 99=19839, 99.9=31359, 99.99=90367] 
2018-12-28 19:39:31:294 20 sec: 271763 operations; 14749 current ops/sec; est completion in 11 minutes [READ: Count=147490, Max=28207, Min=1246, Avg=6777.82, 90=8559, 99=17151, 99.9=20927, 99.99=24319] 
2018-12-28 19:39:41:294 30 sec: 419616 operations; 14785.3 current ops/sec; est completion in 11 minutes [READ: Count=147865, Max=29903, Min=1554, Avg=6762.16, 90=8535, 99=17087, 99.9=20719, 99.99=23551] 
2018-12-28 19:39:51:294 40 sec: 556054 operations; 13643.8 current ops/sec; est completion in 11 minutes [READ: Count=136426, Max=33247, Min=1572, Avg=7327.45, 90=9847, 99=18671, 99.9=24655, 99.99=28159] 
2018-12-28 19:40:01:294 50 sec: 704273 operations; 14821.9 current ops/sec; est completion in 11 minutes [READ: Count=148227, Max=27615, Min=1164, Avg=6744.66, 90=8511, 99=16959, 99.9=20719, 99.99=24303] 
2018-12-28 19:40:11:294 60 sec: 850808 operations; 14653.5 current ops/sec; est completion in 10 minutes [READ: Count=146527, Max=28559, Min=2130, Avg=6823.35, 90=8583, 99=17327, 99.9=21103, 99.99=24367] 
2018-12-28 19:40:21:294 70 sec: 997112 operations; 14630.4 current ops/sec; est completion in 10 minutes [READ: Count=146304, Max=27343, Min=1489, Avg=6833.71, 90=8567, 99=17343, 99.9=21055, 99.99=24159] 
2018-12-28 19:40:31:294 80 sec: 1143444 operations; 14633.2 current ops/sec; est completion in 10 minutes [READ: Count=146336, Max=26495, Min=1725, Avg=6833.16, 90=8583, 99=17215, 99.9=21007, 99.99=24255] 
2018-12-28 19:40:41:294 90 sec: 1291906 operations; 14846.2 current ops/sec; est completion in 10 minutes [READ: Count=148468, Max=27487, Min=1339, Avg=6733.57, 90=8471, 99=17007, 99.9=20831, 99.99=23967] 
2018-12-28 19:40:51:294 100 sec: 1428834 operations; 13692.8 current ops/sec; est completion in 10 minutes [READ: Count=136937, Max=35423, Min=1345, Avg=7301.93, 90=9807, 99=18511, 99.9=24927, 99.99=29823] 
2018-12-28 19:41:01:294 110 sec: 1576681 operations; 14784.7 current ops/sec; est completion in 9 minutes [READ: Count=147830, Max=26223, Min=1105, Avg=6763.11, 90=8511, 99=17087, 99.9=20719, 99.99=23855] 
2018-12-28 19:41:11:294 120 sec: 1724888 operations; 14820.7 current ops/sec; est completion in 9 minutes [READ: Count=148216, Max=28143, Min=1650, Avg=6745.04, 90=8455, 99=17039, 99.9=20783, 99.99=23983] 
2018-12-28 19:41:21:294 130 sec: 1872836 operations; 14794.8 current ops/sec; est completion in 9 minutes [READ: Count=147944, Max=29263, Min=1256, Avg=6758.54, 90=8487, 99=17087, 99.9=20783, 99.99=24559] 
2018-12-28 19:41:31:294 140 sec: 2020104 operations; 14726.8 current ops/sec; est completion in 9 minutes [READ: Count=147261, Max=27215, Min=1687, Avg=6788.76, 90=8527, 99=16975, 99.9=20799, 99.99=24079] 
2018-12-28 19:41:41:294 150 sec: 2169010 operations; 14890.6 current ops/sec; est completion in 9 minutes [READ: Count=148906, Max=27775, Min=1816, Avg=6714.98, 90=8447, 99=16943, 99.9=20543, 99.99=23247] 
2018-12-28 19:41:51:294 160 sec: 2306156 operations; 13714.6 current ops/sec; est completion in 8 minutes [READ: Count=137146, Max=34975, Min=2027, Avg=7288.47, 90=9767, 99=18527, 99.9=24591, 99.99=29343] 
2018-12-28 19:42:01:294 170 sec: 2450177 operations; 14402.1 current ops/sec; est completion in 8 minutes [READ: Count=144044, Max=29183, Min=1694, Avg=6942.43, 90=8847, 99=17567, 99.9=22047, 99.99=25343] 
2018-12-28 19:42:11:294 180 sec: 2599769 operations; 14959.2 current ops/sec; est completion in 8 minutes [READ: Count=149570, Max=27807, Min=1833, Avg=6684.29, 90=8415, 99=16831, 99.9=20399, 99.99=23471] 
2018-12-28 19:42:21:294 190 sec: 2747784 operations; 14801.5 current ops/sec; est completion in 8 minutes [READ: Count=148023, Max=29343, Min=1847, Avg=6754.65, 90=8495, 99=17023, 99.9=20703, 99.99=23919] 
2018-12-28 19:42:31:294 200 sec: 2895629 operations; 14784.5 current ops/sec; est completion in 8 minutes [READ: Count=147836, Max=28303, Min=945, Avg=6761.94, 90=8471, 99=17039, 99.9=20671, 99.99=23439] 
2018-12-28 19:42:41:294 210 sec: 3043527 operations; 14789.8 current ops/sec; est completion in 8 minutes [READ: Count=147898, Max=26687, Min=2138, Avg=6760.71, 90=8519, 99=17087, 99.9=20687, 99.99=23871] 
2018-12-28 19:42:51:294 220 sec: 3182258 operations; 13873.1 current ops/sec; est completion in 7 minutes [READ: Count=138731, Max=41503, Min=1433, Avg=7207.23, 90=9575, 99=18335, 99.9=24143, 99.99=30927] 
2018-12-28 19:43:01:294 230 sec: 3323506 operations; 14124.8 current ops/sec; est completion in 7 minutes [READ: Count=141248, Max=36255, Min=1823, Avg=7077.72, 90=9423, 99=17775, 99.9=25023, 99.99=30703] 
2018-12-28 19:43:11:294 240 sec: 3472252 operations; 14874.6 current ops/sec; est completion in 7 minutes [READ: Count=148746, Max=29935, Min=1673, Avg=6722.09, 90=8407, 99=16959, 99.9=20767, 99.99=23663] 
2018-12-28 19:43:21:294 250 sec: 3620927 operations; 14867.5 current ops/sec; est completion in 7 minutes [READ: Count=148679, Max=36703, Min=1247, Avg=6724.91, 90=8471, 99=16975, 99.9=21087, 99.99=24735] 
2018-12-28 19:43:31:294 260 sec: 3769364 operations; 14843.7 current ops/sec; est completion in 7 minutes [READ: Count=148441, Max=28559, Min=1657, Avg=6735.6, 90=8423, 99=17039, 99.9=20719, 99.99=23839] 
2018-12-28 19:43:41:294 270 sec: 3917556 operations; 14819.2 current ops/sec; est completion in 7 minutes [READ: Count=148184, Max=27103, Min=1719, Avg=6746.58, 90=8455, 99=17007, 99.9=20735, 99.99=23807] 
2018-12-28 19:43:51:294 280 sec: 4060480 operations; 14292.4 current ops/sec; est completion in 6 minutes [READ: Count=142924, Max=31679, Min=1611, Avg=6995.03, 90=9223, 99=17695, 99.9=23327, 99.99=28703] 
2018-12-28 19:44:01:294 290 sec: 4200344 operations; 13986.4 current ops/sec; est completion in 6 minutes [READ: Count=139864, Max=37439, Min=1264, Avg=7148.88, 90=9655, 99=18095, 99.9=24495, 99.99=29183] 
2018-12-28 19:44:11:294 300 sec: 4349571 operations; 14922.7 current ops/sec; est completion in 6 minutes [READ: Count=149227, Max=26863, Min=1554, Avg=6699.58, 90=8383, 99=16895, 99.9=20735, 99.99=23327] 
2018-12-28 19:44:21:294 310 sec: 4497793 operations; 14822.2 current ops/sec; est completion in 6 minutes [READ: Count=148223, Max=29471, Min=1648, Avg=6745.75, 90=8455, 99=17007, 99.9=20847, 99.99=25103] 
2018-12-28 19:44:31:294 320 sec: 4648505 operations; 15071.2 current ops/sec; est completion in 6 minutes [READ: Count=150723, Max=30143, Min=1693, Avg=6633.19, 90=8287, 99=16735, 99.9=20303, 99.99=23071] 
2018-12-28 19:44:41:294 330 sec: 4798051 operations; 14954.6 current ops/sec; est completion in 5 minutes [READ: Count=149534, Max=27743, Min=1276, Avg=6686.25, 90=8407, 99=16991, 99.9=20607, 99.99=23663] 
2018-12-28 19:44:51:294 340 sec: 4939408 operations; 14135.7 current ops/sec; est completion in 5 minutes [READ: Count=141375, Max=39967, Min=1807, Avg=7072.14, 90=9343, 99=17839, 99.9=23647, 99.99=29215] 
2018-12-28 19:45:01:294 350 sec: 5078763 operations; 13935.5 current ops/sec; est completion in 5 minutes [READ: Count=139337, Max=35167, Min=1737, Avg=7175.09, 90=9583, 99=18031, 99.9=24047, 99.99=28159] 
2018-12-28 19:45:11:294 360 sec: 5226699 operations; 14793.6 current ops/sec; est completion in 5 minutes [READ: Count=147937, Max=26927, Min=1118, Avg=6758.69, 90=8455, 99=17103, 99.9=20895, 99.99=24095] 
2018-12-28 19:45:21:294 370 sec: 5374700 operations; 14800.1 current ops/sec; est completion in 5 minutes [READ: Count=148000, Max=28463, Min=1905, Avg=6754.74, 90=8447, 99=17023, 99.9=20863, 99.99=24111] 
2018-12-28 19:45:31:294 380 sec: 5522826 operations; 14812.6 current ops/sec; est completion in 5 minutes [READ: Count=148126, Max=27871, Min=1923, Avg=6750.3, 90=8447, 99=17039, 99.9=20655, 99.99=24223] 
2018-12-28 19:45:41:294 390 sec: 5672342 operations; 14951.6 current ops/sec; est completion in 4 minutes [READ: Count=149516, Max=26175, Min=1163, Avg=6686.97, 90=8407, 99=16959, 99.9=20703, 99.99=23327] 
2018-12-28 19:45:51:294 400 sec: 5817840 operations; 14549.8 current ops/sec; est completion in 4 minutes [READ: Count=145498, Max=29567, Min=1167, Avg=6871.27, 90=8855, 99=17359, 99.9=21983, 99.99=26383] 
2018-12-28 19:46:01:294 410 sec: 5959779 operations; 14193.9 current ops/sec; est completion in 4 minutes [READ: Count=141939, Max=36127, Min=1263, Avg=7044.3, 90=9463, 99=17727, 99.9=23887, 99.99=30047] 
2018-12-28 19:46:11:294 420 sec: 6110785 operations; 15100.6 current ops/sec; est completion in 4 minutes [READ: Count=151006, Max=26175, Min=1589, Avg=6621.35, 90=8319, 99=16751, 99.9=20511, 99.99=23359] 
2018-12-28 19:46:21:294 430 sec: 6260790 operations; 15000.5 current ops/sec; est completion in 4 minutes [READ: Count=150013, Max=25503, Min=1976, Avg=6663.83, 90=8367, 99=16879, 99.9=20607, 99.99=23327] 
2018-12-28 19:46:31:294 440 sec: 6408439 operations; 14764.9 current ops/sec; est completion in 4 minutes [READ: Count=147641, Max=28175, Min=1134, Avg=6772.15, 90=8479, 99=17103, 99.9=20863, 99.99=23999] 
2018-12-28 19:46:41:294 450 sec: 6557180 operations; 14874.1 current ops/sec; est completion in 3 minutes [READ: Count=148741, Max=27423, Min=1121, Avg=6721.61, 90=8439, 99=17007, 99.9=20783, 99.99=23599] 
2018-12-28 19:46:51:294 460 sec: 6700868 operations; 14368.8 current ops/sec; est completion in 3 minutes [READ: Count=143688, Max=32175, Min=1944, Avg=6958.09, 90=9111, 99=17503, 99.9=23519, 99.99=28415] 
2018-12-28 19:47:01:294 470 sec: 6840620 operations; 13975.2 current ops/sec; est completion in 3 minutes [READ: Count=139752, Max=38879, Min=1858, Avg=7154.63, 90=9743, 99=17999, 99.9=24543, 99.99=30543] 
2018-12-28 19:47:11:294 480 sec: 6988552 operations; 14793.2 current ops/sec; est completion in 3 minutes [READ: Count=147942, Max=27535, Min=1895, Avg=6757.5, 90=8447, 99=17119, 99.9=20959, 99.99=24447] 
2018-12-28 19:47:21:294 490 sec: 7138246 operations; 14969.4 current ops/sec; est completion in 3 minutes [READ: Count=149685, Max=27039, Min=1297, Avg=6679.67, 90=8351, 99=16863, 99.9=20719, 99.99=23903] 
2018-12-28 19:47:31:294 500 sec: 7288568 operations; 15032.2 current ops/sec; est completion in 3 minutes [READ: Count=150337, Max=28319, Min=1928, Avg=6651.81, 90=8287, 99=16847, 99.9=20591, 99.99=23855] 
2018-12-28 19:47:41:294 510 sec: 7428525 operations; 13995.7 current ops/sec; est completion in 2 minutes [READ: Count=139956, Max=34591, Min=1977, Avg=7142.42, 90=9463, 99=18127, 99.9=23759, 99.99=28815] 
2018-12-28 19:47:51:294 520 sec: 7573446 operations; 14492.1 current ops/sec; est completion in 2 minutes [READ: Count=144912, Max=31679, Min=2134, Avg=6900.03, 90=8783, 99=17343, 99.9=21615, 99.99=25615] 
2018-12-28 19:48:01:294 530 sec: 7688401 operations; 11495.5 current ops/sec; est completion in 2 minutes [READ: Count=114955, Max=58463, Min=2592, Avg=8694.92, 90=11703, 99=21903, 99.9=28207, 99.99=34399] 
2018-12-28 19:48:11:294 540 sec: 7794514 operations; 10611.3 current ops/sec; est completion in 2 minutes [READ: Count=106111, Max=41087, Min=3110, Avg=9423.61, 90=12567, 99=23327, 99.9=29983, 99.99=35135] 
2018-12-28 19:48:21:294 550 sec: 7934036 operations; 13952.2 current ops/sec; est completion in 2 minutes [READ: Count=139518, Max=33983, Min=1604, Avg=7166.97, 90=9615, 99=18159, 99.9=24143, 99.99=28895] 
2018-12-28 19:48:31:294 560 sec: 8083742 operations; 14970.6 current ops/sec; est completion in 2 minutes [READ: Count=149708, Max=25727, Min=1521, Avg=6678.44, 90=8351, 99=16927, 99.9=20671, 99.99=23455] 
2018-12-28 19:48:41:294 570 sec: 8231123 operations; 14738.1 current ops/sec; est completion in 2 minutes [READ: Count=147379, Max=34399, Min=1700, Avg=6784.08, 90=8583, 99=17103, 99.9=21231, 99.99=25231] 
2018-12-28 19:48:51:294 580 sec: 8377321 operations; 14619.8 current ops/sec; est completion in 1 minute [READ: Count=146198, Max=33919, Min=2118, Avg=6838.43, 90=8815, 99=17151, 99.9=22463, 99.99=26991] 
2018-12-28 19:49:01:294 590 sec: 8522918 operations; 14559.7 current ops/sec; est completion in 1 minute [READ: Count=145597, Max=29855, Min=1792, Avg=6867.2, 90=8719, 99=17327, 99.9=21839, 99.99=25871] 
2018-12-28 19:49:11:294 600 sec: 8662214 operations; 13929.6 current ops/sec; est completion in 1 minute [READ: Count=139296, Max=36831, Min=2012, Avg=7177.19, 90=9623, 99=17983, 99.9=24751, 99.99=30271] 
2018-12-28 19:49:21:294 610 sec: 8793368 operations; 13115.4 current ops/sec; est completion in 1 minute [READ: Count=131161, Max=35071, Min=2258, Avg=7621.84, 90=10543, 99=19439, 99.9=26271, 99.99=31103] 
2018-12-28 19:49:31:294 620 sec: 8941222 operations; 14785.4 current ops/sec; est completion in 1 minute [READ: Count=147848, Max=29359, Min=1769, Avg=6764.01, 90=8495, 99=17039, 99.9=20991, 99.99=24495] 
2018-12-28 19:49:41:294 630 sec: 9089535 operations; 14831.3 current ops/sec; est completion in 1 minute [READ: Count=148324, Max=28527, Min=839, Avg=6740.64, 90=8423, 99=16991, 99.9=20847, 99.99=24559] 
2018-12-28 19:49:51:294 640 sec: 9233314 operations; 14377.9 current ops/sec; est completion in 54 seconds [READ: Count=143767, Max=31487, Min=1679, Avg=6954.37, 90=8815, 99=17519, 99.9=21807, 99.99=25279] 
2018-12-28 19:50:01:294 650 sec: 9380213 operations; 14689.9 current ops/sec; est completion in 43 seconds [READ: Count=146899, Max=30767, Min=1588, Avg=6805.42, 90=8687, 99=17215, 99.9=21791, 99.99=26223] 
2018-12-28 19:50:11:294 660 sec: 9520593 operations; 14038 current ops/sec; est completion in 34 seconds [READ: Count=140380, Max=37151, Min=2206, Avg=7121.9, 90=9383, 99=17839, 99.9=24159, 99.99=28943] 
2018-12-28 19:50:21:294 670 sec: 9671741 operations; 15114.8 current ops/sec; est completion in 23 seconds [READ: Count=151153, Max=26479, Min=1834, Avg=6615.01, 90=8271, 99=16639, 99.9=20191, 99.99=23583] 
2018-12-28 19:50:31:294 680 sec: 9822282 operations; 15054.1 current ops/sec; est completion in 13 seconds [READ: Count=150536, Max=29631, Min=1102, Avg=6641.81, 90=8335, 99=16719, 99.9=20447, 99.99=23743] 
2018-12-28 19:50:41:294 690 sec: 9971781 operations; 14949.9 current ops/sec; est completion in 2 second [READ: Count=149516, Max=28783, Min=2088, Avg=6687.19, 90=8343, 99=16831, 99.9=20511, 99.99=23375] 
2018-12-28 19:50:45:578 694 sec: 10000000 operations; 6587.07 current ops/sec; [READ: Count=28202, Max=21295, Min=394, Avg=5371.62, 90=7515, 99=14903, 99.9=18191, 99.99=20927] [CLEANUP: Count=100, Max=2213887, Min=0, Avg=22129.66, 90=3, 99=8, 99.9=2213887, 99.99=2213887] 
[OVERALL], RunTime(ms), 694283
[OVERALL], Throughput(ops/sec), 14403.348490457061
[TOTAL_GCS_PS_Scavenge], Count, 638
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 1108
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.15958910127426423
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 638
[TOTAL_GC_TIME], Time(ms), 1108
[TOTAL_GC_TIME_%], Time(%), 0.15958910127426423
[READ], Operations, 10000000
[READ], AverageLatency(us), 6908.3727232
[READ], MinLatency(us), 394
[READ], MaxLatency(us), 94655
[READ], 95thPercentileLatency(us), 11047
[READ], 99thPercentileLatency(us), 17391
[READ], Return=OK, 10000000
[CLEANUP], Operations, 100
[CLEANUP], AverageLatency(us), 22129.66
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 2213887
[CLEANUP], 95thPercentileLatency(us), 3
[CLEANUP], 99thPercentileLatency(us), 8